<?php

namespace Dok\BX\InfoBlock;

class Main {
	
	// =========================================================================
	// === ПАРАМЕТРЫ ОБЪЕКТА ===================================================
	// =========================================================================
	
	/**
	 * Подключен ли модуль для работы с инфоблоками
	 * @var bool
	 */
	private $isModuleInclude;


	/**
	 * ID инфоблока
	 * @var int
	 */
	private $id;


	/**
	 * Атрибуты выборки сущности
	 * @var array
	 */
	private $data;


	// =========================================================================
	// === КОНСТРУКТОР, ГЕТТЕРЫ и СЕТТЕРЫ ======================================
	// =========================================================================
	
	public function __construct() {
		$this->isModuleInclude = \Bitrix\Main\Loader::includeModule('iblock');
		
	}
	
	
	// =========================================================================
	// === МЕТОДЫ ОБЪЕКТА ======================================================
	// =========================================================================
	
	/**
	 * Метод возвращает ID инфоблока по символьному коду
	 * @param string $code
	 * @return int ID инфоблока
	 */
	public function getIblockByCode($code) {
		if(!is_string($code) || !$code || !$this->isModuleInclude) {return;}
		
		$res = \CIBlock::GetList(
			Array(), Array('CODE' => $code)
		);
		
		while($arRes = $res->Fetch()) {
			if($arRes['ID']) {
				$this->id	= intval($arRes['ID']);
				$this->data	= $arRes;
				
				break;
				
			}
	
		}
		
		return $this->id;
		
	}
	
	
	// =========================================================================
	// === СТАТИЧЕСКАЯ ОБВЯЗКА =================================================
	// =========================================================================
	
	/**
	 * Функция возвращает ID инфоблока по символьному коду
	 * @param string $code
	 * @return int ID инфоблока
	 */
	static function getByCode($code) {
		$ib = new self;
		
		$result = $ib->getIblockByCode($code);
		
		return $result;
		
	}


}
